<?php
//错误信息提示统一配置存在此处
return array(
    'common'=>'参数错误',
    'attendance' =>array(
        0 => '今日您已签到',
        1 => '签到天数已满30',
        2 => '签到奖励领取成功',
        3 => '签到奖励领取失败',
    ),
    'user' =>array(
        0 => '登录成功',
        1 => '请先登录',
        2 => '签名验证失败',
        3 => '数据已过期',
        4 => '数据写入失败',
        5 => '用户名为空',
        6 => '两次输入的密码不一致',
        7 => '手机号不存在,请正确输入手机号',
        8 => '参数错误',
        9 => '请正确输入密码',
        10 => '注册失败，请重试',
        11 => '该昵称已被占用',
        12 => '暂无动态',
        13 => '昵称不可为空',
        14 => '请填写正确昵称',
        15 => '您已经修改过用户名'
    ),
    'bind'=>array(
        0 => '绑定成功',
        1 => '请先登录',
        2 => '绑定失败',
        3 => '已绑定手机'
    ),
    'turnplate' =>array(
        0 => '获取成功',
        1 => '砖石数量不足',
        2 => '木头数量不足',
    ),
    'buy'     =>array(
        0 => '购买成功',
        1 => '购买数量不合法',
        2 => '超过最大个人购买数量',
        3 => '木头数量不足',
        4 => '砖石数量不足',
        5 => '输入数据不合法',
        6 => '获取不到商品信息',
        7 => '商品库存不足',
        8 => '商品信息填写不完整',
        9 => '请填写收货人信息'
    ),
    'address' =>array(
        0 => '地址添加成功',
        1 => '地址添加失败',
        2 => '默认地址无法删除',
        3 => '地址最多添加5条',
    ),
    'delete'    =>array(
        0 => '删除成功',
        1 => '删除失败'
    ),
    'edit'    =>array(
        0 => '修改成功',
        1 => '修改失败'
    ),
    'customer' =>array(
        0 => '问题提交成功',
        1 => '问题提交失败',
        2 => '输入数据异常'
    ),

    'order'   =>array(
        0 => '获取成功',
        1 => '订单号为空',
        2 => '查询不到订单信息',
        3 => '无订单信息',
        4 => '未发货'
    ),
    'rank'    =>array(
        0 => '称号设置成功',
        1 => '称号设置失败',
    ),
    'redcode' =>array(
        0 => '兑换成功',
        1 => '兑换码不能为空',
        2 => '兑换码错误',
        3 => '该兑换码已被兑换',
        4 => '暂无兑换记录',
        5 => '错误尝试次数过多'
    ),
    'reg' => array(
        0 => '注册成功',
        1 => '未通过短信验证',
        2 => '已过领取时间'
    ),    
    'forget' => array(
        0 => '密码更改成功',
        1 => '更改密码失败'
    ),
    'sms' => array(
        0 => '发送成功',
        1 => '该号码已被注册',
        2 => '该号码还未注册',
        3 => '请60s后再发送',
        4 => '验证码超时',
        5 => '该号码已被注册,请更换其他手机绑定',
        6 => '您请求的次数超过限制',
        7 => '该号码还未注册',
        8 => '今天请求次数达到上限',
        9 => '验证码错误',
        10 => 'token验证错误',
        11 => '该号码已被锁定，请更换手机号'
    ),
    'room' => array(
        0 => '获取成功',
        1 => '获取失败',
        2 => '查询的比赛不存在',
        3 => '投注已截止',
        4 => '投注达到上限',
        5 => '门票不够',
        6 => '所选阵容总工资超过给定工资帽',
        7 => '系统错误',
        8 => '房间人数已满',
        9 => '项目id数据异常',
        10 => '一支队伍中最多选择4个选手',
        11 => '暂时无法获取阵容',
        12 => '一支队伍中最多选择7个选手'
    ),
    'guess' => array(
        0 => '竞猜成功',
        1 => '竞猜失败',
        2 => '无法获取投注信息',
        3 => '房间人数已满,不允许撤销',
        4 => '比赛已开始,不允许撤销',
        5 => '你不允许投注该房间',
        6 => '阵容已存在',
        7 => '没有接收到房间id',
        8 => '没有接收到投注数量',
        9 => '投注人数不正确',
        10 => '所选球员不在房间中',
        11 => '阵容位置是不满足配置要求',
        12 => '添加投注数据失败',
    ),
    'editlineup' => array(
        0 => '阵容修改成功',
        1 => '阵容修改失败',
        2 => '已存在该阵容',
        3 => '无法获取已选阵容的房间信息',
        4 => '房间比赛已经结束无法修改',
        5 => '所选球员不在该房间中比赛中',
        6 => '所选球员中存在已经上场了的球员',
        7 => '阵容没做任何修改,无法提交'
    ),
    'extra' => array(
        0 => '获取成功'
    ),
    'reward' => array(
        0 => '领取成功',
        1 => '获取失败',
        2 => '参数异常',
        3 => '不符合领取要求',
        4 => '该手机已经领过该奖项',
        5 => '领奖信息不存在或者你已经领取过',
        6 => '实物领取请联系客服'
    ),
    'revoke' => array(
        0 => '撤销成功'
    ),
    'lineup' => array(
        0 => '撤销成功',
        1 => '数据不存在'
    ),
    'system' => array(
        0 => '成功',
        1 => '系统错误'
    ),
    'charge' => array(
        0 => 'success',
        1 => '充值金额不正确',
        2 => '微信订单创建失败',
        3 => '用户支付信息不存在'
    ),
    'champion' => array(
        0 => 'success',
        1 => '参数异常',
        2 => '比赛不存在',
        3 => '没有比赛队伍',
        4 => '无法获取比赛队员',
        5 => '投注已经截止',
        6 => '您已经投注过了',
        7 => '阵容人数不够',
        8 => '所选选手同一个队伍最多选择3人',
        9 => '所选阵容超过可用工资',
        10 => '所选选手位置不正确',
        11 => '投注失败,请重试',
        12 => '红包已被领完',
        13 => '已达到领取上限',
        14 => '分享者没有投注',
        15 => '您还没有投注',
        16 => '您已领取过该积分红包'
    ),
    'upload' => array(
        0 => '上传成功',
        1 => '请上传后缀为png, jpg, jpeg, gif图片',
        2 => '文件大于2M',
        3 => '无文件上传',
        4 => '上传失败'
    ),
    'wxlogin' => array(
        0 => 'success',
        1 => '微信授权失败'
    ),
    'login' => array(
        0 => 'success',
        1 => '无法获取用户信息',
        3 => '失败'
    ),
    'act' => array(
        0 => 'success',
        1 => '用户不存在',
        2 => '分享信息有误',
        100 => '用户没有投注过'

    ),
    'addguess' => array(
        0 => 'success',
        1 => '投注的房间不存在',
        2 => '上一个房间的id不存在',
        3 => '阵容id不存在',
        4 => '无法获取投注的阵容',
        5 => '投注房间选择不正确',
        6 => '所选房间阵容配置不一致,无法投注',
        100 => '用户没有投注过'
    )

);